polymathrobotics/protective-stop/machn/sdkconfig.defaults
# MicroLink Dual-Core Safety — sdkconfig defaults
CONFIG_IDF_TARGET="esp32s3"

# W5500 SPI Ethernet (Waveshare ESP32-S3-ETH board). Highest-priority netif;
# see components/dcs_support/src/dcs_eth.c for the pin map and bring-up.
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# Flash size (8MB)
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Partition table (OTA, no factory)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# OTA rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM (8 MB in-package octal die). Route the bulk of heap to PSRAM so the
# WG/TLS/Tailscale working set + WiFi driver fit alongside each other in the
# scarce ~350 KB internal DRAM. ALWAYSINTERNAL=2048 sends allocations >2 KB to
# PSRAM (default 16384 kept almost everything internal); TRY_ALLOCATE_WIFI_LWIP
# pushes WiFi/lwIP buffers out too; RESERVE_INTERNAL keeps 32 KB internal for
# DMA/ISR-only allocations.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# lwIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
# Per-socket TCP receive mailbox. Default 6 was overflowing the DERP socket
# the instant ml_coord's peer-table ingestion ran on the adjacent coord
# socket — the DERP HTTP-upgrade response dropped behind 6 queued pbufs.
# 32 gives the TCPIP thread room to back-pressure properly.
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
# Hot-path lwIP code in IRAM — measurably reduces TCPIP-thread latency
# under sustained Tailscale + USB-NCM load. Costs ~6 KiB IRAM, easily
# affordable on the S3.
CONFIG_LWIP_IRAM_OPTIMIZATION=y
# Bigger TCPIP stack. v15.11 bump from 4 KiB → 8 KiB to accommodate the
# direct-UDP WireGuard receive path. With zero-copy, an incoming WG data
# packet runs *entirely* on the TCPIP thread: zc_pcb_recv_cb →
# wireguardif_network_rx → wireguardif_process_data_message (ChaCha20-
# Poly1305 decrypt) → ip_input → ip4_input → icmp_input → icmp_echo
# → ip4_output → wg_netif_output → wireguardif_output → encrypt → udp_sendto.
# That recursive ip_input + crypto + lwIP-output call chain blew the 4 KiB
# stack canary in v15.9 within ~3 s of sustained ping load — the canary
# tripped esp_panic_handler and the chip rebooted, which we saw as
# 87 % packet loss + bc++. 8 KiB has comfortable headroom.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192

# mbedTLS
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# Dynamic TLS buffers: the DERP handshake (cert-chain verify against the CA
# bundle) is the largest transient internal-RAM consumer and OOM'd WiFi when
# both were up. DYNAMIC_BUFFER allocates the SSL I/O buffers on demand and frees
# them + the CA copy + config data after the handshake, cutting the steady and
# peak internal footprint so WiFi+Tailscale coexist without crashing.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y

# FreeRTOS — both cores active, 1 kHz tick
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Runtime stats for per-core CPU load reporting (esp_timer clock, ~µs per ctx switch)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# Expose TaskStatus_t.xCoreID for per-core task breakdown
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# WiFi
# Internal-RAM Phase 3 (2026-08-08): WiFi static TX buffers 16 -> 6, matching the
# remote (firmware/sdkconfig.defaults). Returns ~16 KB internal DMA at
# esp_wifi_init so WiFi fits alongside the resident USB-NCM stack (OOM-panic fix;
# paired with the dcs_wifi.c WIFI_MIN_INTERNAL_HEAP guard, a shared component).
# TX-side only; RX ring left at stock to protect the WPA2 EAPOL handshake.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# === Watchdogs (SR-H-04b machine-side / FMEA DU-2: frozen-clock / frozen-task)
# Mirrors the remote's watchdog stack (docs/WATCHDOG_CLOCK_PROTECTION.md) as the
# last-resort backstop behind the comparator's esp_timer-vs-FreeRTOS-tick clock
# sanity (machn/main/main.c). TWDT: the comparator subscribes explicitly and
# feeds every 100 ms tick; a wedged comparator trips it (PANIC=y -> reset). The
# IWDT catches a total systimer freeze (the tick ISR stops feeding it); its
# stage-2 RTC-WDT hard-resets if the panic handler hangs.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_BOOTLOADER_WDT_ENABLE=y

# SoftAP fallback. When the chip has no usable network after
# CONFIG_ML_AP_FALLBACK_TIMEOUT_S seconds of WiFi-association attempts,
# it switches to APSTA mode and hosts its own AP so a user can join and
# add a working network via the admin panel — critical for the case
# where USB-NCM is off AND the configured WiFi networks are out of
# range. (Earlier disabled-by-default because v5's mode-switch hung
# under TinyUSB load; v15.x boots WiFi only when usb_enabled=0 so the
# hang condition no longer applies.) Timeout default 60s.
CONFIG_ML_AP_FALLBACK_ENABLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HTTP Config Server (admin panel)
CONFIG_ML_ENABLE_CONFIG_HTTPD=y
CONFIG_ML_CONFIG_MAX_ALLOWED_PEERS=512

# ML_MAX_PEERS matches WIREGUARD_MAX_PEERS=16 (kept in wireguard-platform.h
# at the same value because more wg peers exhausts internal RAM at boot).
# priority_peer_ip in NVS keeps the host in the 16-slot table via the LRU
# eviction code in ml_wg_mgr.c.
CONFIG_ML_MAX_PEERS=128
CONFIG_ML_DEFAULT_MAX_PEERS=32   # production active-set default (ceiling stays 128)
CONFIG_ML_NVS_MAX_PEERS=128

# Browser request headers can easily exceed the 512-byte default.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# USB-CDC-NCM tether (ml_dev_tether). Host gets a usbN interface; the ESP
# routes Tailscale via the host. CDC-ACM enabled alongside so /dev/ttyACM*
# console still works while NCM is up.
CONFIG_TINYUSB_NET_MODE_NCM=y
# NTB buffers are DMA-pinned to internal SRAM (USB-OTG can't reach PSRAM). The
# default 3+3 (~19 KB) is sized for throughput; this is a low-rate fallback
# tether, so 2+2 (~13 KB) frees ~6 KB internal for the WiFi/WG/TLS stacks.
CONFIG_TINYUSB_NCM_OUT_NTB_BUFFS_COUNT=2
CONFIG_TINYUSB_NCM_IN_NTB_BUFFS_COUNT=4
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
# Route ESP_LOG over USB CDC so boot logs flow through the composite device
# (USB-Serial-JTAG is replaced by TinyUSB OTG once tinyusb_driver_install runs).
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=n
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
# USB descriptors
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Polymath"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="MicroLink dual_core_safety"

# v15.20 — lwIP TCPIP core locking. Required by upstream microlink
# PR#14: WG packet processing (process_wg_packet -> wireguardif_network_rx
# -> ip_input/output) runs from ml_wg_mgr task, NOT the TCPIP thread.
# Without core locking, those calls race with TCPIP thread's own work
# and silently corrupt pbuf/netif state — which is the root cause of
# the ~100-180 s silent panic under sustained direct-UDP traffic.
CONFIG_LWIP_TCPIP_CORE_LOCKING=y

# Crash diagnostics: save an ELF core dump to flash on every panic, readable
# over the network (no UART adapter on the bench, and TinyUSB displaces the
# ROM-JTAG once USB-NCM runs). 128KB coredump partition carved from ota_1's
# tail (see partitions.csv). Unblocks remote backtraces for any panic.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64

# Centralized configuration management / OTA. The firmware's check-in and
# OTA tooling is intended to pair with a management backend of your own;
# none is included in this project. The backend address, URL, and API key
# are site-specific and live in sdkconfig.credentials (never committed):
# CONFIG_ML_FLEET_SERVER_IP, CONFIG_ML_OTA_BACKEND_URL, CONFIG_ML_OTA_API_KEY.

# mbedTLS allocates its TLS working buffers from PSRAM, not internal RAM.
# Internal RAM runs 5-13KB free on this build; a DERP TLS handshake needs
# ~20-30KB transiently (IN_CONTENT_LEN 16K + OUT 4K + scratch), so with
# INTERNAL_MEM_ALLOC the reconnect OOMs and DERP stays down. External (PSRAM)
# alloc fixes it; prereq CONFIG_SPIRAM_USE_MALLOC is set. TLS runs in the
# derp_tx/net_io tasks (not ISR/cache-disabled) and is NOT the WireGuard/pstop
# datapath crypto, so the safety heartbeat path is unaffected.
# See docs/INTERNAL_RAM_REDUCTION.md.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# =============================================================================
# machn (ESP32 machine node) overrides — everything above is the shared
# platform baseline copied from the remote; below is what differs by role.
# =============================================================================
# Identity: machn-01<mac24> on the tailnet (DCS_ID_PREFIX is set by CMake).
# Device class for backend type-gating of firmware assignments.
CONFIG_ML_DEVICE_TYPE="machine"
# Wrong-lineage OTA backstop: refuse any image that is not the machine app.
CONFIG_ML_OTA_REQUIRE_PROJECT="machn_machine"
# Machines are never auto-updated by the backend (belt-and-braces; the
# server-side type gate is the primary control).
CONFIG_ML_OTA_AUTO_UPDATE=n

# === perf branch: performance tuning (A/B against -Og baseline) ===
# App at -O2 (project default was -Og debug). Speeds crypto, lockstep,
# packet processing, netmap parse, boot init — everything.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Keep runtime assertions ON — this is a safety device; catching a bad
# state is worth the cycles.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# Flash Quad-I/O: ~2x read throughput -> faster bootloader app-load and
# faster XIP (cache-miss) code execution.
# Trim bootloader chatter (was INFO).
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=y

# === machn: relay-feedback (read-back) monitoring gate ===
# DESCOPED by default (n): a new machine-specific hardware revision + wiring
# diagram makes the divider feedback voltages unreadable. Relays are still
# DRIVEN; only the read-back/fault path is compiled out. Reversible: set y to
# restore feedback on hardware that supports it (re-verify SENSE pins / divider
# ratios / RELAY_FEEDBACK_MS first). See docs/RELAY_FEEDBACK_DESCOPE.md.
CONFIG_MACHN_RELAY_FEEDBACK=n
